package main

var AllFormulas = []*Formula{
	//基础资源
	{"铁矿", 0, "矿脉", 1, 1, false, false, nil},
	{"铜矿", 0, "矿脉", 1, 1, false, false, nil},
	{"石矿", 0, "矿脉", 1, 1, false, false, nil},
	{"煤矿", 0, "矿脉", 1, 1, false, false, nil},
	{"钛矿", 0, "矿脉", 1, 1, false, false, nil},
	{"硅石", 0, "矿脉", 1, 1, false, false, nil},
	{"水", 0, "抽水机", 1, 1, false, false, nil},
	{"氢", 0, "原油精炼厂", 8, 3, true, true, []ResourceNum{
		{"原油", 2},
		{"高能石墨", -2},
	}},
	{"氢", 1, "轨道采集器", 1, 20, false, false, nil},
	{"重氢", 0, "分馏器", 100.0 / 30, 1, false, false, []ResourceNum{
		{"氢", 1},
	}},
	{"重氢", 1, "轨道采集器", 1, 1, false, false, nil},

	//珍奇
	{"原油", 0, "原油萃取机", 1, 1, false, false, nil},
	{"硫酸", 1, "抽水机", 1, 1, false, false, nil},
	{"可燃冰", 0, "轨道采集器", 1, 1, false, false, nil},
	{"有机晶体", 1, "矿脉", 1, 1, false, false, nil},
	{"刺笋结晶", 0, "矿脉", 1, 1, false, false, nil},
	{"光栅石", 0, "矿脉", 1, 1, false, false, nil},
	{"金伯利矿石", 0, "矿脉", 1, 1, false, false, nil},
	{"分形硅", 0, "矿脉", 1, 1, false, false, nil},
	{"单极磁石", 0, "矿脉", 1, 1, false, false, nil},

	//
	{"临界光子", 0, "微波接收器", 12, 1, false, false, nil},
	{"反物质", 0, "粒子对撞机", 2, 2, true, false, []ResourceNum{
		{"临界光子", 2},
		{"氢", -2},
	}},

	//
	{"铁块", 0, "电弧熔炉", 1, 1, true, true, []ResourceNum{
		{"铁矿", 1},
	}},
	{"磁铁", 0, "电弧熔炉", 1.5, 1, true, true, []ResourceNum{
		{"铁矿", 1},
	}},
	{"铜块", 0, "电弧熔炉", 1, 1, true, true, []ResourceNum{
		{"铜矿", 1},
	}},
	{"高纯硅块", 0, "电弧熔炉", 2, 1, true, true, []ResourceNum{
		{"硅石", 2},
	}},
	{"钛块", 0, "电弧熔炉", 2, 1, true, true, []ResourceNum{
		{"钛矿", 2},
	}},
	{"石材", 0, "电弧熔炉", 1, 1, true, true, []ResourceNum{
		{"石矿", 1},
	}},
	{"玻璃", 0, "电弧熔炉", 2, 1, true, true, []ResourceNum{
		{"石矿", 2},
	}},
	{"高能石墨", 0, "电弧熔炉", 2, 1, true, false, []ResourceNum{
		{"煤矿", 2},
	}},
	{"金刚石", 0, "电弧熔炉", 2, 1, true, true, []ResourceNum{
		{"高能石墨", 1},
	}},
	{"金刚石", 1, "电弧熔炉", 1.5, 2, true, true, []ResourceNum{
		{"金伯利矿石", 1},
	}},
	{"精炼油", 0, "原油精炼厂", 4, 2, true, true, []ResourceNum{
		{"原油", 2},
		{"氢", -1},
	}},
	{"晶格硅", 0, "电弧熔炉", 2, 1, true, true, []ResourceNum{
		{"高纯硅块", 1},
	}},
	{"晶格硅", 1, "制造台", 1.5, 2, true, true, []ResourceNum{
		{"分形硅", 1},
	}},
	{"钢材", 0, "电弧熔炉", 3, 1, true, true, []ResourceNum{
		{"铁块", 3},
	}},

	{"硫酸", 0, "化工厂", 6, 4, true, true, []ResourceNum{
		{"精炼油", 6},
		{"石矿", 8},
		{"水", 4},
	}},
	{"塑料", 0, "化工厂", 3, 1, true, true, []ResourceNum{
		{"精炼油", 2},
		{"高能石墨", 1},
	}},
	{"有机晶体", 0, "化工厂", 6, 1, true, true, []ResourceNum{
		{"塑料", 2},
		{"精炼油", 1},
		{"水", 1},
	}},
	{"石墨烯", 0, "化工厂", 3, 2, true, true, []ResourceNum{
		{"高能石墨", 3},
		{"硫酸", 1},
	}},
	{"石墨烯", 1, "化工厂", 2, 2, true, true, []ResourceNum{
		{"可燃冰", 2},
		{"氢", -1},
	}},
	{"碳纳米管", 0, "化工厂", 4, 2, true, true, []ResourceNum{
		{"石墨烯", 3},
		{"钛块", 1},
	}},
	{"碳纳米管", 1, "化工厂", 4, 2, true, true, []ResourceNum{
		{"刺笋结晶", 6},
	}},

	{"增产剂MK1", 0, "制造台", 0.5, 1, true, true, []ResourceNum{
		{"煤矿", 1},
	}},
	{"增产剂MK2", 0, "制造台", 1, 1, true, true, []ResourceNum{
		{"增产剂MK1", 2},
		{"金刚石", 1},
	}},
	{"增产剂MK3", 0, "制造台", 2, 1, true, true, []ResourceNum{
		{"增产剂MK2", 2},
		{"碳纳米管", 1},
	}},

	{"电路板", 0, "制造台", 1, 2, true, true, []ResourceNum{
		{"铁块", 2},
		{"铜块", 1},
	}},
	{"磁线圈", 0, "制造台", 1, 2, true, true, []ResourceNum{
		{"磁铁", 2},
		{"铜块", 1},
	}},
	{"齿轮", 0, "制造台", 1, 1, true, true, []ResourceNum{
		{"铁块", 1},
	}},
	{"电动机", 0, "制造台", 2, 1, true, true, []ResourceNum{
		{"铁块", 2},
		{"齿轮", 1},
		{"磁线圈", 1},
	}},
	{"电磁涡轮", 0, "制造台", 2, 1, true, true, []ResourceNum{
		{"电动机", 2},
		{"磁线圈", 2},
	}},
	{"超级磁场环", 0, "制造台", 3, 1, true, true, []ResourceNum{
		{"电磁涡轮", 2},
		{"磁铁", 3},
		{"高能石墨", 1},
	}},
	{"粒子容器", 0, "制造台", 4, 1, true, true, []ResourceNum{
		{"电磁涡轮", 2},
		{"铜块", 2},
		{"石墨烯", 2},
	}},
	{"粒子容器", 1, "制造台", 4, 1, true, true, []ResourceNum{
		{"单极磁石", 10},
		{"铜块", 2},
	}},

	//==============================

	{"棱镜", 0, "制造台", 2, 2, true, true, []ResourceNum{
		{"玻璃", 3},
	}},
	{"电浆激发器", 0, "制造台", 2, 1, true, true, []ResourceNum{
		{"磁线圈", 4},
		{"棱镜", 2},
	}},
	{"钛晶石", 0, "制造台", 4, 1, true, true, []ResourceNum{
		{"有机晶体", 1},
		{"钛块", 3},
	}},
	{"钛合金", 0, "电弧熔炉", 12, 4, true, true, []ResourceNum{
		{"钛块", 4},
		{"钢材", 4},
		{"硫酸", 8},
	}},

	//==============================

	{"粒子宽带", 0, "制造台", 8, 1, true, true, []ResourceNum{
		{"碳纳米管", 2},
		{"晶格硅", 2},
		{"塑料", 1},
	}},
	{"微晶元件", 0, "制造台", 2, 1, true, true, []ResourceNum{
		{"高纯硅块", 2},
		{"铜块", 1},
	}},
	{"处理器", 0, "制造台", 3, 1, true, true, []ResourceNum{
		{"电路板", 2},
		{"微晶元件", 2},
	}},

	//==============================

	{"钛化玻璃", 0, "制造台", 5, 2, true, true, []ResourceNum{
		{"玻璃", 2},
		{"钛块", 2},
		{"水", 2},
	}},
	{"卡西米尔晶体", 0, "制造台", 4, 1, true, true, []ResourceNum{
		{"钛晶石", 1},
		{"石墨烯", 2},
		{"氢", 12},
	}},
	{"卡西米尔晶体", 1, "制造台", 4, 1, true, true, []ResourceNum{
		{"光栅石", 8},
		{"石墨烯", 2},
		{"氢", 12},
	}},
	{"位面过滤器", 0, "制造台", 12, 1, true, true, []ResourceNum{
		{"卡西米尔晶体", 1},
		{"钛化玻璃", 2},
	}},
	{"量子芯片", 0, "制造台", 6, 1, true, true, []ResourceNum{
		{"处理器", 2},
		{"位面过滤器", 2},
	}},

	{"奇异物质", 0, "粒子对撞机", 8, 1, true, true, []ResourceNum{
		{"粒子容器", 2},
		{"铁块", 2},
		{"重氢", 10},
	}},

	{"引力透镜", 0, "制造台", 6, 1, true, true, []ResourceNum{
		{"金刚石", 4},
		{"奇异物质", 1},
	}},

	//==============================

	{"液氢燃料棒", 0, "制造台", 6, 2, true, true, []ResourceNum{
		{"钛块", 1},
		{"氢", 10},
	}},
	{"氘核燃料棒", 0, "制造台", 12, 2, true, true, []ResourceNum{
		{"重氢", 20},
		{"钛合金", 1},
		{"超级磁场环", 1},
	}},
	{"湮灭约束球", 0, "制造台", 20, 1, true, true, []ResourceNum{
		{"粒子容器", 1},
		{"处理器", 1},
	}},
	{"反物质燃料棒", 0, "制造台", 24, 2, true, false, []ResourceNum{
		{"反物质", 12},
		{"氢", 12},
		{"湮灭约束球", 1},
		{"钛合金", 1},
	}},

	//==============================

	{"推进器", 0, "制造台", 4, 1, true, true, []ResourceNum{
		{"钢材", 2},
		{"铜块", 3},
	}},
	{"物流运输机", 0, "制造台", 4, 1, true, false, []ResourceNum{
		{"铁块", 5},
		{"处理器", 2},
		{"推进器", 2},
	}},
	{"加力推进器", 0, "制造台", 6, 1, true, true, []ResourceNum{
		{"钛合金", 5},
		{"电磁涡轮", 5},
	}},
	{"星际物流运输船", 0, "制造台", 6, 1, true, false, []ResourceNum{
		{"钛合金", 10},
		{"处理器", 10},
		{"加力推进器", 2},
	}},

	//==============================

	{"光子合并器", 0, "制造台", 3, 1, true, true, []ResourceNum{
		{"棱镜", 2},
		{"电路板", 1},
	}},
	{"光子合并器", 1, "制造台", 3, 1, true, true, []ResourceNum{
		{"光栅石", 1},
		{"电路板", 1},
	}},
	{"太阳帆", 0, "制造台", 4, 2, true, true, []ResourceNum{
		{"石墨烯", 1},
		{"光子合并器", 1},
	}},
	{"框架材料", 0, "制造台", 6, 1, true, true, []ResourceNum{
		{"碳纳米管", 4},
		{"钛合金", 1},
		{"高纯硅块", 1},
	}},
	{"戴森球组件", 0, "制造台", 8, 1, true, true, []ResourceNum{
		{"框架材料", 3},
		{"太阳帆", 3},
		{"处理器", 3},
	}},
	{"小型运输火箭", 0, "制造台", 6, 1, true, true, []ResourceNum{
		{"戴森球组件", 2},
		{"氘核燃料棒", 4},
		{"量子芯片", 2},
	}},

	//==============================

	{"电磁矩阵", 0, "研究所", 3, 1, true, true, []ResourceNum{
		{"磁线圈", 1},
		{"电路板", 1},
	}},
	{"能量矩阵", 0, "研究所", 6, 1, true, true, []ResourceNum{
		{"高能石墨", 2},
		{"氢", 2},
	}},
	{"结构矩阵", 0, "研究所", 8, 1, true, true, []ResourceNum{
		{"金刚石", 1},
		{"钛晶石", 1},
	}},
	{"信息矩阵", 0, "研究所", 10, 1, true, true, []ResourceNum{
		{"处理器", 2},
		{"粒子宽带", 1},
	}},
	{"引力矩阵", 0, "研究所", 24, 2, true, true, []ResourceNum{
		{"引力透镜", 1},
		{"量子芯片", 1},
	}},
	{"宇宙矩阵", 0, "研究所", 15, 1, true, true, []ResourceNum{
		{"电磁矩阵", 1},
		{"能量矩阵", 1},
		{"结构矩阵", 1},
		{"信息矩阵", 1},
		{"引力矩阵", 1},
		{"反物质", 1},
	}},

	//==============================

	{"空间翘曲器", 0, "制造台", 10, 8, true, true, []ResourceNum{
		{"引力矩阵", 1},
	}},

	//==============================

	{"行星内物流运输站", 0, "制造台", 20, 1, true, true, []ResourceNum{
		{"钢材", 40},
		{"钛块", 40},
		{"处理器", 40},
		{"粒子容器", 20},
	}},
	{"星际物流运输站", 0, "制造台", 30, 1, true, false, []ResourceNum{
		{"行星内物流运输站", 1},
		{"钛合金", 40},
		{"粒子容器", 20},
	}},
	{"能量枢纽", 0, "制造台", 15, 1, true, true, []ResourceNum{
		{"钛合金", 40},
		{"钢材", 40},
		{"处理器", 40},
		{"粒子容器", 8},
	}},
	{"推进器", 0, "制造台", 4, 1, true, true, []ResourceNum{
		{"钢材", 2},
		{"铜块", 3},
	}},
	{"物流运输机", 0, "制造台", 4, 1, true, false, []ResourceNum{
		{"铁块", 5},
		{"处理器", 2},
		{"推进器", 2},
	}},
	{"加力推进器", 0, "制造台", 6, 1, true, true, []ResourceNum{
		{"钛合金", 5},
		{"电磁涡轮", 5},
	}},
	{"星际物流运输船", 0, "制造台", 6, 1, true, false, []ResourceNum{
		{"钛合金", 10},
		{"处理器", 10},
		{"加力推进器", 2},
	}},

}

var facilityOrder = map[string]int{
	"矿脉":    1,
	"原油萃取机": 2,
	"抽水机":   3,
	"轨道采集器": 4,
	"电弧熔炉":  5,
	"原油精炼厂": 6,
	"化工厂":   7,
	"分馏器":   8,
	"制造台":   9,
	"粒子对撞机": 10,
	"微波接收器": 11,
	"研究所":   12,
}

var defaultIncreaseFacilities = map[string]bool {
	"制造台": true,
	"粒子对撞机": true,
	"研究所": true,
}

var SprayingMark1 = &SprayingClass{
	Resource:    "增产剂MK1",
	SpeedUpRate: 1.25,
	BonusRate:   1.125,
	PowerRate:   1.3,
	Count:       12,
}
var SprayingMark2 = &SprayingClass{
	Resource:    "增产剂MK2",
	SpeedUpRate: 1.5,
	BonusRate:   1.2,
	PowerRate:   1.7,
	Count:       24,
}
var SprayingMark3 = &SprayingClass{
	Resource:    "增产剂MK3",
	SpeedUpRate: 2.0,
	BonusRate:   1.25,
	PowerRate:   2.5,
	Count:       60,
}
